create_clock -period 5.000 -name io_sysclk_ref_clk200 -waveform {0.000 2.500} [get_ports SYSCLK_P]
create_clock -period 10.000 -name io_pcie_ref_clk -waveform {0.000 5.000} [get_ports PCIE_CLK_QO_P]
create_clock -period 2.570 -name io_hispi_clk_top -waveform {0.000 1.285} [get_ports FMC_HPC_CLK0_M2C_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -min -add_delay 1.440 [get_ports FMC_HPC_LA11_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -max -add_delay 1.490 [get_ports FMC_HPC_LA11_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -min -add_delay 1.440 [get_ports FMC_HPC_LA11_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -max -add_delay 1.490 [get_ports FMC_HPC_LA11_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -min -add_delay 1.440 [get_ports FMC_HPC_LA07_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -max -add_delay 1.490 [get_ports FMC_HPC_LA07_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -min -add_delay 1.440 [get_ports FMC_HPC_LA07_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -max -add_delay 1.490 [get_ports FMC_HPC_LA07_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -min -add_delay 1.440 [get_ports FMC_HPC_LA03_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -max -add_delay 1.490 [get_ports FMC_HPC_LA03_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -min -add_delay 1.440 [get_ports FMC_HPC_LA03_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -max -add_delay 1.490 [get_ports FMC_HPC_LA03_P]
create_clock -period 2.570 -name io_hispi_clk_bottom -waveform {0.000 1.285} [get_ports FMC_HPC_CLK1_M2C_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -min -add_delay 1.440 [get_ports FMC_HPC_LA28_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -max -add_delay 1.490 [get_ports FMC_HPC_LA28_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -min -add_delay 1.440 [get_ports FMC_HPC_LA28_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -max -add_delay 1.490 [get_ports FMC_HPC_LA28_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -min -add_delay 1.440 [get_ports FMC_HPC_LA27_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -max -add_delay 1.490 [get_ports FMC_HPC_LA27_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -min -add_delay 1.440 [get_ports FMC_HPC_LA27_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -max -add_delay 1.490 [get_ports FMC_HPC_LA27_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -min -add_delay 1.440 [get_ports FMC_HPC_LA23_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -max -add_delay 1.490 [get_ports FMC_HPC_LA23_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -min -add_delay 1.440 [get_ports FMC_HPC_LA23_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -max -add_delay 1.490 [get_ports FMC_HPC_LA23_P]
create_generated_clock -name pixClk_0 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/G_lane_decoder[0].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_2 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/G_lane_decoder[1].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_4 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/G_lane_decoder[2].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_1 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/G_lane_decoder[0].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_3 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/G_lane_decoder[1].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_5 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/G_lane_decoder[2].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_clock -period 2.570 -name io_hispi_clk_top -waveform {0.000 1.285} [get_ports FMC_HPC_CLK0_M2C_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -min -add_delay 0.386 [get_ports FMC_HPC_LA11_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -max -add_delay 0.899 [get_ports FMC_HPC_LA11_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -min -add_delay 0.386 [get_ports FMC_HPC_LA11_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -max -add_delay 0.899 [get_ports FMC_HPC_LA11_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -min -add_delay 0.386 [get_ports FMC_HPC_LA07_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -max -add_delay 0.899 [get_ports FMC_HPC_LA07_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -min -add_delay 0.386 [get_ports FMC_HPC_LA07_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -max -add_delay 0.899 [get_ports FMC_HPC_LA07_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -min -add_delay 0.386 [get_ports FMC_HPC_LA03_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -max -add_delay 0.899 [get_ports FMC_HPC_LA03_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -min -add_delay 0.386 [get_ports FMC_HPC_LA03_P]
set_input_delay -clock [get_clocks io_hispi_clk_top] -clock_fall -max -add_delay 0.899 [get_ports FMC_HPC_LA03_P]
create_clock -period 2.570 -name io_hispi_clk_bottom -waveform {0.000 1.285} [get_ports FMC_HPC_CLK1_M2C_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -min -add_delay 0.386 [get_ports FMC_HPC_LA28_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -max -add_delay 0.899 [get_ports FMC_HPC_LA28_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -min -add_delay 0.386 [get_ports FMC_HPC_LA28_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -max -add_delay 0.899 [get_ports FMC_HPC_LA28_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -min -add_delay 0.386 [get_ports FMC_HPC_LA27_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -max -add_delay 0.899 [get_ports FMC_HPC_LA27_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -min -add_delay 0.386 [get_ports FMC_HPC_LA27_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -max -add_delay 0.899 [get_ports FMC_HPC_LA27_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -min -add_delay 0.386 [get_ports FMC_HPC_LA23_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -max -add_delay 0.899 [get_ports FMC_HPC_LA23_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -min -add_delay 0.386 [get_ports FMC_HPC_LA23_P]
set_input_delay -clock [get_clocks io_hispi_clk_bottom] -clock_fall -max -add_delay 0.899 [get_ports FMC_HPC_LA23_P]
create_generated_clock -name pixClk_0 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/G_lane_decoder[0].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_2 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/G_lane_decoder[1].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_4 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/G_lane_decoder[2].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_1 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/G_lane_decoder[0].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_3 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/G_lane_decoder[1].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name pixClk_5 -source [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O"}] -divide_by 2 [get_pins -hier -filter {NAME =~"*XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/G_lane_decoder[2].inst_lane_decoder/xbit_split/hclk_div2_reg/Q"}]
create_generated_clock -name axiClk62MHz -source [get_pins xsystem_wrapper/system_i/pcie2AxiMaster_0/U0/xxil_pcie/pcie_7x_0_xil_wrapper/inst/inst/gt_top_i/pipe_wrapper_i/pipe_clock_int.pipe_clock_i/mmcm_i/CLKIN1] -master_clock txoutclk_x0y0 [get_pins xsystem_wrapper/system_i/pcie2AxiMaster_0/U0/xxil_pcie/pcie_7x_0_xil_wrapper/inst/inst/gt_top_i/pipe_wrapper_i/pipe_clock_int.pipe_clock_i/mmcm_i/CLKOUT2]
create_generated_clock -name hclk_bottom -source [get_pins xsystem_wrapper/system_i/XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/I] -master_clock io_hispi_clk_bottom [get_pins xsystem_wrapper/system_i/XGS_athena_0/U0/x_xgs_hispi_top/xbottom_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O]
create_generated_clock -name hclk_top -source [get_pins xsystem_wrapper/system_i/XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/I] -master_clock io_hispi_clk_top [get_pins xsystem_wrapper/system_i/XGS_athena_0/U0/x_xgs_hispi_top/xtop_hispi_phy/xhispi_serdes/xhispi_phy_xilinx/inst/clkout_buf_inst/O]
